<template>
  <section>
    <TopImage />
    <p class="about-description">
      UI / UX エンジニア 兼 エンジニアリングマネージャ<br />
      <br />
      オンライン旅行予約システム(楽天トラベル)の開発を主務としている。<br />
      卒業後、楽天に入社。楽天トラベルの開発に配属。<br />
      国際業務チームにて、海外ホテルの予約システムや管理画面、経理システム、インバウンドサイト、外部システム連携等の開発、立ち上げに参画<br />
      フルスタックエンジニアとして従事していたが、
      2017年以降UI/UXを専門領域としたUI/UXエンジニア・エンジニアリングマネージャとしてサービス・システム開発に携わる。<br />
      現在は、楽天トラベルのWebフロントエンドチーム、Android/iOSチームのエンジニアリングマネージャとして、
      サービス/組織開発に携わっている。<br />
      フリーランス・プライベートではプロダクトデザイン含めた企画・デザイン・開発に携わっている。<br />
      趣味はバスケと偶にする海外旅行。 好きなものはコーヒー、お酒、和食。
    </p>
    <p class="about-description">
      楽天所属のUI / UX エンジニア兼エンジニアリングマネージャ<br />
      <br />
      オンライン旅行予約システム(楽天トラベル)の開発を主務としている。<br />
      卒業後、楽天に入社し、楽天トラベルの様々なシステム開発に携わっている。<br />
      フルスタックエンジニアとして従事していたが、
      2017年のシステム刷新のタイミング以降UI/UXを専門領域としたUI/UXエンジニア・エンジニアリングマネージャとしてサービス・システム開発に携わる。<br />
      現在は、楽天トラベルのWebフロントエンドチーム、Android/iOSチームのエンジニアリングマネージャとして、
      サービス/組織開発に携わっている。<br />
      フリーランス・プライベートではプロダクトデザイン含めた企画・デザイン・開発に携わっている。<br />
      趣味はバスケと偶にする海外旅行。 好きなものはコーヒー、お酒、和食。
    </p>
    <p class="about-description">
      楽天所属のUI / UX エンジニア兼エンジニアリングマネージャ<br />
      <br />
      オンライン旅行予約システム(楽天トラベル)の開発を主務としている。<br />
      卒業後、楽天に入社し、楽天トラベルの様々なシステム開発に携わっている。<br />
      フルスタックエンジニアとして従事していたが、
      2017年のシステム刷新のタイミング以降UI/UXを専門領域としたUI/UXエンジニア・エンジニアリングマネージャとしてサービス・システム開発に携わる。<br />
      現在は、楽天トラベルのWebフロントエンドチーム、Android/iOSチームのエンジニアリングマネージャとして、
      サービス/組織開発に携わっている。<br />
      フリーランス・プライベートではプロダクトデザイン含めた企画・デザイン・開発に携わっている。<br />
      趣味はバスケと偶にする海外旅行。 好きなものはコーヒー、お酒、和食。
    </p>
  </section>
</template>

<script>
import TopImage from '~/components/tmp/TopImage.vue'
export default {
  components: {
    TopImage
  }
}
</script>

<style lang="scss">
.about-description {
  width: 70%;
  margin: 0 auto;
  margin-top: 100px;
  text-align: initial;
}
</style>
